zhiqiangme/RGB-Matrix-Px-xx/example/Arduino/arduino_v3.3.7/R7FA4-PLUS-A/RGBmatrixPanel.cpp
  // Init a few extra 32x32-specific elements:
  _d = d;
  addrdport = portOutputRegister(digitalPinToPort(d));
  addrdmask = digitalPinToBitMask(d);
}

// Constructor for 64x64 panel:
RGBmatrixPanel::RGBmatrixPanel(uint8_t a, uint8_t b, uint8_t c, uint8_t d, uint8_t e,
                               uint8_t clk, uint8_t lat, uint8_t oe,
                               boolean dbuf, uint8_t width
#if defined(ARDUINO_ARCH_SAMD) || defined(ARDUINO_ARCH_ESP32) || defined(ARDUINO_ARCH_RENESAS)
                               ,
                               uint8_t *pinlist
#endif
                               ,
                               uint8_t panelOptions
                               )
    : Adafruit_GFX(width, 64) {

  init(32, a, b, c, clk, lat, oe, dbuf, width
#if defined(ARDUINO_ARCH_SAMD) || defined(ARDUINO_ARCH_ESP32) || defined(ARDUINO_ARCH_RENESAS)
       ,
       pinlist
#endif
       ,
       panelOptions
  );

  // Init a few extra 32-specific elements:
  _d = d;
  addrdport = portOutputRegister(digitalPinToPort(d));
  addrdmask = digitalPinToBitMask(d);
  // Init a few extra 64-specific elements:
  _e = e;
  addreport = portOutputRegister(digitalPinToPort(e));
  addremask = digitalPinToBitMask(e);
}

// Constructor for panels using custom scan row counts such as
// 80x40 (1/20 scan) and 96x48 (1/24 scan).
RGBmatrixPanel::RGBmatrixPanel(uint8_t a, uint8_t b, uint8_t c, uint8_t d,
                               uint8_t e, uint8_t clk, uint8_t lat,
                               uint8_t oe, boolean dbuf, uint8_t width,
                               uint8_t rows
#if defined(ARDUINO_ARCH_SAMD) || defined(ARDUINO_ARCH_ESP32) || defined(ARDUINO_ARCH_RENESAS)
                               ,
                               uint8_t *pinlist
#endif
                               ,
                               uint8_t panelOptions
                               )
    : Adafruit_GFX(width, rows * 2) {

  init(rows, a, b, c, clk, lat, oe, dbuf, width
#if defined(ARDUINO_ARCH_SAMD) || defined(ARDUINO_ARCH_ESP32) || defined(ARDUINO_ARCH_RENESAS)
       ,
       pinlist
#endif
       ,
       panelOptions
  );

  _d = d;
  addrdport = portOutputRegister(digitalPinToPort(d));
  addrdmask = digitalPinToBitMask(d);
  _e = e;
  addreport = portOutputRegister(digitalPinToPort(e));
  addremask = digitalPinToBitMask(e);
}

bool RGBmatrixPanel::hasPanelOption(uint8_t option) const {
  return (panelOptions & option) != 0;
}

#if defined(ARDUINO_ARCH_SAMD)
#define TIMER TC4
#define IRQN TC4_IRQn
#define IRQ_HANDLER TC4_Handler
#define TIMER_GCLK_ID TC4_GCLK_ID
#elif defined(ARDUINO_ARCH_ESP32)
IRAM_ATTR void IRQ_HANDLER(void *);
#endif

void RGBmatrixPanel::begin(void) {

  backindex = 0;                       // Back buffer
  buffptr = matrixbuff[1 - backindex]; // -> front buffer
  activePanel = this;                  // For interrupt hander

  // Enable all comm & address pins as outputs, set default states:
  pinMode(_clk, OUTPUT);
  digitalWrite(_clk, LOW); // Low
  pinMode(_lat, OUTPUT);
  *latport &= ~latmask; // Low
  pinMode(_oe, OUTPUT);
  *oeport |= oemask; // High (disable output)
  pinMode(_a, OUTPUT);
  *addraport &= ~addramask; // Low
  pinMode(_b, OUTPUT);
  *addrbport &= ~addrbmask; // Low
  pinMode(_c, OUTPUT);
  *addrcport &= ~addrcmask; // Low
  if (!hasPanelOption(RGBMATRIX_PANEL_OPTION_SM5368_ABC) && (nRows > 8)) {
    pinMode(_d, OUTPUT);
    *addrdport &= ~addrdmask; // Low
  }
  if (!hasPanelOption(RGBMATRIX_PANEL_OPTION_SM5368_ABC) && (nRows > 16)) {
    pinMode(_e, OUTPUT);
    *addreport &= ~addremask; // Low
  }

#if defined(__AVR__)

  // The high six bits of the data port are set as outputs;
  // Might make this configurable in the future, but not yet.
  DATADIR = B11111100;
  DATAPORT = 0;

#elif defined(ARDUINO_ARCH_SAMD)

  // Semi-configurable RGB bits; must be on same PORT as CLK
  int clkportnum = g_APinDescription[_clk].ulPort;
#ifdef __SAMD51__ // No IOBUS on SAMD51
  outsetreg = &(PORT->Group[clkportnum].OUTSET.reg);
  outclrreg = &(PORT->Group[clkportnum].OUTCLR.reg);
#else
  outsetreg = &(PORT_IOBUS->Group[clkportnum].OUTSET.reg);
  outclrreg = &(PORT_IOBUS->Group[clkportnum].OUTCLR.reg);
#endif

  PortType rgbmask[6];
  clkmask = rgbclkmask = digitalPinToBitMask(_clk);
  for (uint8_t i = 0; i < 6; i++) {
    pinMode(rgbpins[i], OUTPUT);
    rgbmask[i] = digitalPinToBitMask(rgbpins[i]); // Pin bit mask
    rgbclkmask |= rgbmask[i];                     // Add to RGB+CLK bit mask
  }
  for (int i = 0; i < 256; i++) {
    expand[i] = 0;
    if (i & 0x04)
      expand[i] |= rgbmask[0];
    if (i & 0x08)
      expand[i] |= rgbmask[1];
    if (i & 0x10)
      expand[i] |= rgbmask[2];
    if (i & 0x20)
      expand[i] |= rgbmask[3];
    if (i & 0x40)
      expand[i] |= rgbmask[4];
    if (i & 0x80)
      expand[i] |= rgbmask[5];
  }
#elif defined(ARDUINO_ARCH_ESP32)
  // Semi-configurable RGB bits; must be on same PORT as CLK
  if (_clk < 32) {
    outsetreg = &GPIO.out_w1ts;
    outclrreg = &GPIO.out_w1tc;
  } else {
    outsetreg = (volatile PortType *)&(GPIO.out1_w1ts);
    outclrreg = (volatile PortType *)&(GPIO.out1_w1tc);
  }

  PortType rgbmask[6];
  clkmask = rgbclkmask = digitalPinToBitMask(_clk);
  for (uint8_t i = 0; i < 6; i++) {
    pinMode(rgbpins[i], OUTPUT);
    rgbmask[i] = digitalPinToBitMask(rgbpins[i]); // Pin bit mask
    rgbclkmask |= rgbmask[i];                     // Add to RGB+CLK bit mask
  }
  for (int i = 0; i < 256; i++) {
    expand[i] = 0;
    if (i & 0x04)
      expand[i] |= rgbmask[0];
    if (i & 0x08)
      expand[i] |= rgbmask[1];
    if (i & 0x10)
      expand[i] |= rgbmask[2];
    if (i & 0x20)
      expand[i] |= rgbmask[3];
    if (i & 0x40)
      expand[i] |= rgbmask[4];
    if (i & 0x80)
      expand[i] |= rgbmask[5];
  }
#elif defined(ARDUINO_ARCH_RENESAS)
  // UNO R4: cache direct PORT register pointers/masks for faster refresh.
  uint8_t rgbport_group_index[6];
  rgbport_group_count = 0;
  for (uint8_t i = 0; i < 6; i++) {
    pinMode(rgbpins[i], OUTPUT);
    rgbmask[i] = digitalPinToBitMask(rgbpins[i]);
    rgbport[i] = portOutputRegister(digitalPinToPort(rgbpins[i]));
    *rgbport[i] &= ~rgbmask[i];
    rgbport_group_index[i] = rgbport_group_count;
    for (uint8_t j = 0; j < rgbport_group_count; j++) {
      if (rgbport_group[j] == rgbport[i]) {
        rgbport_group_index[i] = j;
        break;
      }
    }
    if (rgbport_group_index[i] == rgbport_group_count) {
      rgbport_group[rgbport_group_count] = rgbport[i];
      rgbport_group_mask[rgbport_group_count] = 0;
      rgbport_group_count++;
    }
    rgbport_group_mask[rgbport_group_index[i]] |= rgbmask[i];
  }
  for (uint16_t i = 0; i < 256; i++) {
    for (uint8_t j = 0; j < rgbport_group_count; j++) {
      rgbport_expand[i][j] = 0;
    }
    if (i & 0x04)
      rgbport_expand[i][rgbport_group_index[0]] |= rgbmask[0];
    if (i & 0x08)
      rgbport_expand[i][rgbport_group_index[1]] |= rgbmask[1];
    if (i & 0x10)
      rgbport_expand[i][rgbport_group_index[2]] |= rgbmask[2];
    if (i & 0x20)
      rgbport_expand[i][rgbport_group_index[3]] |= rgbmask[3];
    if (i & 0x40)
      rgbport_expand[i][rgbport_group_index[4]] |= rgbmask[4];
    if (i & 0x80)
      rgbport_expand[i][rgbport_group_index[5]] |= rgbmask[5];
  }
#endif

#if defined(ARDUINO_ARCH_ESP32)
  timer_config_t tim_config;
  tim_config.divider = 2; // Run Timer at 40 MHz
  tim_config.counter_dir = TIMER_COUNT_UP;
  tim_config.counter_en = TIMER_PAUSE;
  tim_config.alarm_en = true;
  tim_config.auto_reload = true;
  tim_config.intr_type = TIMER_INTR_LEVEL;

  timer_init(TIMER_GROUP_1, TIMER_0, &tim_config);
  /* Timer's counter will initially start from value below.
       Also, if auto_reload is set, this value will be automatically reload on
     alarm */
  timer_set_counter_value(TIMER_GROUP_1, TIMER_0, 0x00000000ULL);
  /* Configure the alarm value and the interrupt on alarm. */
  timer_set_alarm_value(TIMER_GROUP_1, TIMER_0, 10000);
  timer_enable_intr(TIMER_GROUP_1, TIMER_0);
  timer_isr_register(TIMER_GROUP_1, TIMER_0, IRQ_HANDLER, (void *)TIMER_0,
                     ESP_INTR_FLAG_IRAM, NULL);

  timer_start(TIMER_GROUP_1, TIMER_0);
#endif

#if defined(__AVR__)
  // Set up Timer1 for interrupt:
  TCCR1A = _BV(WGM11);                          // Mode 14 (fast PWM), OC1A off
  TCCR1B = _BV(WGM13) | _BV(WGM12) | _BV(CS10); // Mode 14, no prescale
  ICR1 = 100;
  TIMSK1 |= _BV(TOIE1); // Enable Timer1 interrupt
  sei();                // Enable global interrupts
#endif

