zhiqiangme/RGB-Matrix-Px-xx/example/Arduino/arduino_v3.3.7/R7FA4-PLUS-A/RGBmatrixPanel.cpp
  // Value (brightness) & 16-bit color reduction: similar to above, add 1
  // to allow shifts, and upgrade to int makes other conversions implicit.
  v1 = val + 1;
  if (gflag) { // Gamma-corrected color?
    r = pgm_read_byte(
        &gamma_table[(r * v1) >> 8]); // Gamma correction table maps
    g = pgm_read_byte(
        &gamma_table[(g * v1) >> 8]); // 8-bit input to 4-bit output
    b = pgm_read_byte(&gamma_table[(b * v1) >> 8]);
  } else {              // linear (uncorrected) color
    r = (r * v1) >> 12; // 4-bit results
    g = (g * v1) >> 12;
    b = (b * v1) >> 12;
  }
  return (r << 12) | ((r & 0x8) << 8) | // 4/4/4 -> 5/6/5
         (g << 7) | ((g & 0xC) << 3) | (b << 1) | (b >> 3);
}

void RGBmatrixPanel::DrawString_CN( uint8_t Xstart, uint8_t Ystart, const char * pString, cFONT* font, uint16_t color)
{
  uint8_t bit, shift_x = 0, shift_y;
  uint16_t arr_sum;
  int x = Xstart, y = Ystart;
  const uint8_t* p_text = (const uint8_t*)pString;
  while (*p_text != 0) {
    for (int Num = 0; Num < font->size ; Num++) {
      if ((*p_text == pgm_read_byte(&font->table[Num].index[0])) && (*(p_text + 1) == pgm_read_byte(&font->table[Num].index[1])) && (*(p_text + 2) == pgm_read_byte(&font->table[Num].index[2]))) 
      {

      if (font->Width > 63) {
        shift_y = 3;
        arr_sum = 512;
      } else if (font->Width > 31) {
        shift_y = 2;
        arr_sum = 128;
      } else {
        shift_y = 1;
        arr_sum = 32;
      }

      for (uint16_t i = 0; i < arr_sum; i++) {

        bit = 0x01;
        if(shift_y == 2) {
          switch (i%4) {
          case 0:
            shift_x = 0;
            break;
          case 2:
            shift_x = 16;
            break;

          default:
            break;
          }
        }else if(shift_y == 3) {
          switch (i%8) {
          case 0:
            shift_x = 0;
            break;
          case 2:
            shift_x = 16;
            break;
          case 4:
            shift_x = 32;
            break;
          case 6:
            shift_x = 48;
            break;

          default:
            break;
          }
        }

        if (i%2 == 0) {
          for (int j = 7; j > -1; j--) {
            if (bit & pgm_read_byte(&font->table[Num].matrix[i])) {
              drawPixel(x+j+shift_x, y+(i>>shift_y), color);
            }
            bit <<= 1;
          }
        } else {
          for (int j = 7; j > -1; j--) {
            if (bit & pgm_read_byte(&font->table[Num].matrix[i])) {
              drawPixel(x+j+8+shift_x, y+(i>>shift_y), color);
            }
            bit <<= 1;
          }
        }
      }
      break;
    }   
  }
  p_text += 3;
  x += font->Width;
  }
}

void RGBmatrixPanel::drawPixel(int16_t x, int16_t y, uint16_t c) {
  uint8_t r, g, b, bit, limit, *ptr;

  if ((x < 0) || (x >= _width) || (y < 0) || (y >= _height))
    return;

  switch (rotation) {
  case 1:
    _swap_int16_t(x, y);
    x = WIDTH - 1 - x;
    break;
  case 2:
    x = WIDTH - 1 - x;
    y = HEIGHT - 1 - y;
    break;
  case 3:
    _swap_int16_t(x, y);
    y = HEIGHT - 1 - y;
    break;
  }

  // Adafruit_GFX uses 16-bit color in 5/6/5 format, while matrix needs
  // 4/4/4.  Pluck out relevant bits while separating into R,G,B:
  r = c >> 12 ;        // RRRRrggggggbbbbb
  g = (c >> 7) & 0xF; // rrrrrGGGGggbbbbb
  b = (c >> 1) & 0xF; // rrrrrggggggBBBBb
  if (hasPanelOption(RGBMATRIX_PANEL_OPTION_SWAP_RB)) {
    uint8_t rb = r;
    r = b;
    b = rb;
  }

  // Loop counter stuff
  bit = 2;
  limit = 1 << nPlanes;

  if (y < nRows) {
    // Data for the upper half of the display is stored in the lower
    // bits of each byte.
    ptr = &matrixbuff[backindex][y * WIDTH * (nPlanes - 1) + x]; // Base addr
    // Plane 0 is a tricky case -- its data is spread about,
    // stored in least two bits not used by the other planes.
    ptr[WIDTH * 2] &= ~B00000011; // Plane 0 R,G mask out in one op
    if (r & 1)
      ptr[WIDTH * 2] |= B00000001; // Plane 0 R: 64 bytes ahead, bit 0
    if (g & 1)
      ptr[WIDTH * 2] |= B00000010; // Plane 0 G: 64 bytes ahead, bit 1
    if (b & 1)
      ptr[WIDTH] |= B00000001; // Plane 0 B: 32 bytes ahead, bit 0
    else
      ptr[WIDTH] &= ~B00000001; // Plane 0 B unset; mask out
    // The remaining three image planes are more normal-ish.
    // Data is stored in the high 6 bits so it can be quickly
    // copied to the DATAPORT register w/6 output lines.
    for (; bit < limit; bit <<= 1) {
      *ptr &= ~B00011100; // Mask out R,G,B in one op
      if (r & bit)
        *ptr |= B00000100; // Plane N R: bit 2
      if (g & bit)
        *ptr |= B00001000; // Plane N G: bit 3
      if (b & bit)
        *ptr |= B00010000; // Plane N B: bit 4
      ptr += WIDTH;        // Advance to next bit plane
    }
  } else {
    // Data for the lower half of the display is stored in the upper
    // bits, except for the plane 0 stuff, using 2 least bits.
    ptr = &matrixbuff[backindex][(y - nRows) * WIDTH * (nPlanes - 1) + x];
    *ptr &= ~B00000011; // Plane 0 G,B mask out in one op
    if (r & 1)
      ptr[WIDTH] |= B00000010; // Plane 0 R: 32 bytes ahead, bit 1
    else
      ptr[WIDTH] &= ~B00000010; // Plane 0 R unset; mask out
    if (g & 1)
      *ptr |= B00000001; // Plane 0 G: bit 0
    if (b & 1)
      *ptr |= B00000010; // Plane 0 B: bit 0
    for (; bit < limit; bit <<= 1) {
      *ptr &= ~B11100000; // Mask out R,G,B in one op
      if (r & bit)
        *ptr |= B00100000; // Plane N R: bit 5
      if (g & bit)
        *ptr |= B01000000; // Plane N G: bit 6
      if (b & bit)
        *ptr |= B10000000; // Plane N B: bit 7
      ptr += WIDTH;        // Advance to next bit plane
    }
  }
}

void RGBmatrixPanel::fillScreen(uint16_t c) {
  if ((c == 0x0000) || (c == 0xffff)) {
    // For black or white, all bits in frame buffer will be identically
    // set or unset (regardless of weird bit packing), so it's OK to just
    // quickly memset the whole thing:
    memset(matrixbuff[backindex], c, WIDTH * nRows * 3);
  } else {
    // Otherwise, need to handle it the long way:
    Adafruit_GFX::fillScreen(c);
  }
}

