zhiqiangme/RGB-Matrix-Px-xx/example/Arduino/arduino_v3.3.7/R7FA4-PLUS-A/RGBmatrixPanel.cpp
// Return address of back buffer -- can then load/store data directly
uint8_t *RGBmatrixPanel::backBuffer() { return matrixbuff[backindex]; }

// For smooth animation -- drawing always takes place in the "back" buffer;
// this method pushes it to the "front" for display.  Passing "true", the
// updated display contents are then copied to the new back buffer and can
// be incrementally modified.  If "false", the back buffer then contains
// the old front buffer contents -- your code can either clear this or
// draw over every pixel.  (No effect if double-buffering is not enabled.)
void RGBmatrixPanel::swapBuffers(boolean copy) {
  if (matrixbuff[0] != matrixbuff[1]) {
    // To avoid 'tearing' display, actual swap takes place in the interrupt
    // handler, at the end of a complete screen refresh cycle.
    swapflag = true; // Set flag here, then...
    while (swapflag == true)
      delay(1); // wait for interrupt to clear it
    if (copy == true)
      memcpy(matrixbuff[backindex], matrixbuff[1 - backindex],
             WIDTH * nRows * 3);
  }
}

// Dump display contents to the Serial Monitor, adding some formatting to
// simplify copy-and-paste of data as a PROGMEM-embedded image for another
// sketch.  If using multiple dumps this way, you'll need to edit the
// output to change the 'img' name for each.  Data can then be loaded
// back into the display using a pgm_read_byte() loop.
void RGBmatrixPanel::dumpMatrix(void) {

  int i, buffsize = WIDTH * nRows * 3;

  Serial.print(F("\n\n"
                 "#include <avr/pgmspace.h>\n\n"
                 "static const uint8_t PROGMEM img[] = {\n  "));

  for (i = 0; i < buffsize; i++) {
    Serial.print(F("0x"));
    if (matrixbuff[backindex][i] < 0x10)
      Serial.write('0');
    Serial.print(matrixbuff[backindex][i], HEX);
    if (i < (buffsize - 1)) {
      if ((i & 7) == 7)
        Serial.print(F(",\n  "));
      else
        Serial.write(',');
    }
  }
  Serial.println(F("\n};"));
}

void RGBmatrixPanel::display_image(int16_t x, int16_t y, const uint16_t bitmap[], int16_t w, int16_t h)
{
  Adafruit_GFX::drawRGBBitmap(x,y,bitmap,w,h);
}

void RGBmatrixPanel::setFont(const GFXfont * f)
{
  Adafruit_GFX::setFont(f);
}


// -------------------- Interrupt handler stuff --------------------

#if defined(__AVR__)

ISR(TIMER1_OVF_vect, ISR_BLOCK) { // ISR_BLOCK important -- see notes later
  activePanel->updateDisplay();   // Call refresh func for active display
  TIFR1 |= TOV1;                  // Clear Timer1 interrupt flag
}

#elif defined(ARDUINO_ARCH_SAMD)

void IRQ_HANDLER() {
  activePanel->updateDisplay(); // Call refresh func for active display
  TIMER->COUNT16.INTFLAG.reg = TC_INTFLAG_OVF; // Clear overflow flag
}

#elif defined(ARDUINO_ARCH_ESP32)
IRAM_ATTR void IRQ_HANDLER(void *arg) {
  int timer_idx = (int)arg;
  /* Retrieve the interrupt status and the counter value
           from the timer that reported the interrupt */
  uint32_t intr_status = TIMERG1.int_st_timers.val;
  activePanel->updateDisplay(); // Call refresh func for active display
  /* Clear the interrupt
                   and update the alarm time for the timer with without reload
   */
  if ((intr_status & BIT(timer_idx)) && timer_idx == TIMER_0) {
    TIMERG1.int_clr_timers.t0 = 1;
  }
  /* After the alarm has been triggered
   we need enable it again, so it is triggered the next time */
  TIMERG1.hw_timer[timer_idx].config.alarm_en = TIMER_ALARM_EN;
}

#endif

// Two constants are used in timing each successive BCM interval.
// These were found empirically, by checking the value of TCNT1 at
// certain positions in the interrupt code.
// CALLOVERHEAD is the number of CPU 'ticks' from the timer overflow
// condition (triggering the interrupt) to the first line in the
// updateDisplay() method.  It's then assumed (maybe not entirely 100%
// accurately, but close enough) that a similar amount of time will be
// needed at the opposite end, restoring regular program flow.
// LOOPTIME is the number of 'ticks' spent inside the shortest data-
// issuing loop (not actually a 'loop' because it's unrolled, but eh).
// Both numbers are rounded up slightly to allow a little wiggle room
// should different compilers produce slightly different results.
#if defined(__AVR__)
#define CALLOVERHEAD 60 // Actual value measured = 56
#define LOOPTIME 200    // Actual value measured = 188
#endif
#if defined(ARDUINO_ARCH_SAMD)
#define CALLOVERHEAD 60 // Actual = 58
#define LOOPTIME 600    // Actual = 558
#endif
#if defined(ARDUINO_ARCH_ESP32)
#define CALLOVERHEAD 30 // Actual = 25
#define LOOPTIME 400    // Actual = 1563 / 4
#endif
#if defined(ARDUINO_ARCH_RENESAS)
#define CALLOVERHEAD 60
#define LOOPTIME 350
#define ADDR_SETTLE_US 1
#else
#define ADDR_SETTLE_US 2
#endif
#ifndef CALLOVERHEAD
#define CALLOVERHEAD 60
#endif
#ifndef LOOPTIME
#define LOOPTIME 200
#endif

void RGBmatrixPanel::setRowAddressBinary(uint8_t currentRow) {
  if (currentRow & 0x1) {
    *addraport |= addramask;
  } else {
    *addraport &= ~addramask;
  }
  delayMicroseconds(ADDR_SETTLE_US);
  if (currentRow & 0x2) {
    *addrbport |= addrbmask;
  } else {
    *addrbport &= ~addrbmask;
  }
  delayMicroseconds(ADDR_SETTLE_US);
  if (currentRow & 0x4) {
    *addrcport |= addrcmask;
  } else {
    *addrcport &= ~addrcmask;
  }
  delayMicroseconds(ADDR_SETTLE_US);
  if (nRows > 8) {
    if (currentRow & 0x8) {
      *addrdport |= addrdmask;
    } else {
      *addrdport &= ~addrdmask;
    }
    delayMicroseconds(ADDR_SETTLE_US);
  }
  if (nRows > 16) {
    if (currentRow & 0x10) {
      *addreport |= addremask;
    } else {
      *addreport &= ~addremask;
    }
    delayMicroseconds(ADDR_SETTLE_US);
  }
}

void RGBmatrixPanel::setRowAddressSM5368(uint8_t currentRow) {
  PortType rowDataMask = (currentRow == 0) ? addrcmask : 0;
  *addraport &= ~addramask;
  *addrbport |= addrbmask;
  if (rowDataMask != 0) {
    *addrcport |= addrcmask;
  } else {
    *addrcport &= ~addrcmask;
  }
  delayMicroseconds(ADDR_SETTLE_US);
  *addraport |= addramask;
  delayMicroseconds(ADDR_SETTLE_US);
}

// The "on" time for bitplane 0 (with the shortest BCM interval) can
// then be estimated as LOOPTIME + CALLOVERHEAD * 2.  Each successive
// bitplane then doubles the prior amount of time.  We can then
// estimate refresh rates from this:
// 4 bitplanes = 320 + 640 + 1280 + 2560 = 4800 ticks per row.
// 4800 ticks * 16 rows (for 32x32 matrix) = 76800 ticks/frame.
// 16M CPU ticks/sec / 76800 ticks/frame = 208.33 Hz.
// Actual frame rate will be slightly less due to work being done
// during the brief "LEDs off" interval...it's reasonable to say
// "about 200 Hz."  The 16x32 matrix only has to scan half as many
// rows...so we could either double the refresh rate (keeping the CPU
// load the same), or keep the same refresh rate but halve the CPU
// load.  We opted for the latter.
// Can also estimate CPU use: bitplanes 1-3 all use 320 ticks to
// issue data (the increasing gaps in the timing invervals are then
// available to other code), and bitplane 0 takes 920 ticks out of
// the 2560 tick interval.
// 320 * 3 + 920 = 1880 ticks spent in interrupt code, per row.
// From prior calculations, about 4800 ticks happen per row.
// CPU use = 1880 / 4800 = ~39% (actual use will be very slightly
// higher, again due to code used in the LEDs off interval).
// 16x32 matrix uses about half that CPU load.  CPU time could be
// further adjusted by padding the LOOPTIME value, but refresh rates
// will decrease proportionally, and 200 Hz is a decent target.

// The flow of the interrupt can be awkward to grasp, because data is
// being issued to the LED matrix for the *next* bitplane and/or row
// while the *current* plane/row is being shown.  As a result, the
// counter variables change between past/present/future tense in mid-
// function...hopefully tenses are sufficiently commented.
#if defined(ARDUINO_ARCH_ESP32)
IRAM_ATTR void RGBmatrixPanel::updateDisplay(void) {
#else
void RGBmatrixPanel::updateDisplay(void) {
#endif
#if defined(ARDUINO_ARCH_RENESAS) && RGBMATRIX_RENESAS_ISR_REFRESH
  static volatile bool refresh_busy = false;
  if (refresh_busy) {
    return;
  }
  refresh_busy = true;
#endif
  uint8_t i, tick, tock, *ptr;
  uint16_t t, duration;

  *oeport |= oemask;   // Disable LED output during row/plane switchover
  *latport |= latmask; // Latch data loaded during *prior* interrupt

  // Calculate time to next interrupt BEFORE incrementing plane #.
  // This is because duration is the display time for the data loaded
  // on the PRIOR interrupt.  CALLOVERHEAD is subtracted from the
  // result because that time is implicit between the timer overflow
  // (interrupt triggered) and the initial LEDs-off line at the start
  // of this method.
  t = (nRows > 8) ? LOOPTIME : (LOOPTIME * 2);
  duration = ((t + CALLOVERHEAD * 2) << plane) - CALLOVERHEAD;

