zhiqiangme/RGB-Matrix-Px-xx/example/Arduino/arduino_v3.3.7/R7FA4-PLUS-A/RGBmatrixPanel.cpp
  // Borrowing a technique here from Ray's Logic:
  // www.rayslogic.com/propeller/Programming/AdafruitRGB/AdafruitRGB.htm
  // This code cycles through all four planes for each scanline before
  // advancing to the next line.  While it might seem beneficial to
  // advance lines every time and interleave the planes to reduce
  // vertical scanning artifacts, in practice with this panel it causes
  // a green 'ghosting' effect on black pixels, a much worse artifact.

  if (++plane >= nPlanes) {   // Advance plane counter.  Maxed out?
    plane = 0;                // Yes, reset to plane 0, and
    if (++row >= nRows) {     // advance row counter.  Maxed out?
      row = 0;                // Yes, reset row counter, then...
      if (swapflag == true) { // Swap front/back buffers if requested
        backindex = 1 - backindex;
        swapflag = false;
      }
      buffptr = matrixbuff[1 - backindex]; // Reset into front buffer
    }
  } else if (plane == 1) {
    // Plane 0 was loaded on prior interrupt invocation and is about to
    // latch now, so update the row address lines before we do that:
    if (hasPanelOption(RGBMATRIX_PANEL_OPTION_SM5368_ABC)) {
      setRowAddressSM5368(row);
    } else {
      setRowAddressBinary(row);
    }
  }

  // buffptr, being 'volatile' type, doesn't take well to optimization.
  // A local register copy can speed some things up:
  ptr = (uint8_t *)buffptr;

#if defined(__AVR__)
  ICR1 = duration; // Set interval for next interrupt
  TCNT1 = 0;       // Restart interrupt timer
#elif defined(ARDUINO_ARCH_SAMD)
#ifdef __SAMD51__
  TIMER->COUNT16.CC[0].reg = duration;
  while (TIMER->COUNT16.SYNCBUSY.bit.CC0)
    ;
  TIMER->COUNT16.COUNT.reg = duration;
  while (TIMER->COUNT16.SYNCBUSY.bit.COUNT)
    ;
#else
  TIMER->COUNT16.CC[0].reg = duration;
  while (TIMER->COUNT16.STATUS.bit.SYNCBUSY)
    ;
  TIMER->COUNT16.COUNT.reg = duration;
  while (TIMER->COUNT16.STATUS.bit.SYNCBUSY)
    ;
#endif // SAMD21
#elif defined(ARDUINO_ARCH_ESP32)
static timg_dev_t *TG[2] = {&TIMERG0, &TIMERG1};
static portMUX_TYPE timer_spinlock[TIMER_GROUP_MAX] = {
    portMUX_INITIALIZER_UNLOCKED, portMUX_INITIALIZER_UNLOCKED};
portENTER_CRITICAL(&timer_spinlock[TIMER_GROUP_1]);
TG[TIMER_GROUP_1]->hw_timer[TIMER_0].alarm_high = (uint32_t)(duration >> 32);
TG[TIMER_GROUP_1]->hw_timer[TIMER_0].alarm_low = (uint32_t)duration;
portEXIT_CRITICAL(&timer_spinlock[TIMER_GROUP_1]);
#endif                  // ARDUINO_ARCH_SAMD
  *oeport &= ~oemask;   // Re-enable output
  *latport &= ~latmask; // Latch down

  // Record current state of CLKPORT register, as well as a second
  // copy with the clock bit set.  This makes the innnermost data-
  // pushing loops faster, as they can just set the PORT state and
  // not have to load/modify/store bits every single time.  It's a
  // somewhat rude trick that ONLY works because the interrupt
  // handler is set ISR_BLOCK, halting any other interrupts that
  // might otherwise also be twiddling the port at the same time
  // (else this would clobber them). only needed for AVR's where you
  // cannot set one bit in a single instruction
#if defined(__AVR__)
  tock = CLKPORT;
  tick = tock | clkmask;
#endif

  if (plane > 0) { // 188 ticks from TCNT1=0 (above) to end of function

    // Planes 1-3 copy bytes directly from RAM to PORT without unpacking.
    // The least 2 bits (used for plane 0 data) are presumed masked out
    // by the port direction bits.

#if defined(__AVR__)
    for (i = 0; i < WIDTH; i++) {
      DATAPORT = *ptr++;
      CLKPORT = tick;
      CLKPORT = tock;
    }
#elif defined(ARDUINO_ARCH_SAMD) || defined(ARDUINO_ARCH_ESP32)
    for (i = 0; i < WIDTH; i++) {
      *outclrreg = rgbclkmask;
      *outsetreg = expand[*ptr++];
      *outsetreg = clkmask;
    }
#elif defined(ARDUINO_ARCH_RENESAS)
    for (i = 0; i < WIDTH; i++) {
      uint8_t v = *ptr++;
      for (uint8_t j = 0; j < rgbport_group_count; j++) {
        PortType rgb_value = *rgbport_group[j];
        rgb_value &= ~rgbport_group_mask[j];
        rgb_value |= rgbport_expand[v][j];
        *rgbport_group[j] = rgb_value;
      }
      *clkport |= clkmask;
      *clkport &= ~clkmask;
    }
#endif

#if defined(ARDUINO_ARCH_SAMD) || defined(ARDUINO_ARCH_ESP32)
    *outclrreg = clkmask; // Set clock low
#endif

    buffptr = ptr; //+= 32;

  } else { // 920 ticks from TCNT1=0 (above) to end of function
#if defined(__AVR__)
    // Planes 1-3 (handled above) formatted their data "in place,"
    // their layout matching that out the output PORT register (where
    // 6 bits correspond to output data lines), maximizing throughput
    // as no conversion or unpacking is needed.  Plane 0 then takes up
    // the slack, with all its data packed into the 2 least bits not
    // used by the other planes.  This works because the unpacking and
    // output for plane 0 is handled while plane 3 is being displayed...
    // because binary coded modulation is used (not PWM), that plane
    // has the longest display interval, so the extra work fits.
    for (i = 0; i < WIDTH; i++) {
      DATAPORT = (ptr[i] << 6) | ((ptr[i + WIDTH] << 4) & 0x30) |
                 ((ptr[i + WIDTH * 2] << 2) & 0x0C);
      CLKPORT = tick; // Clock lo
      CLKPORT = tock; // Clock hi
    }
#elif defined(ARDUINO_ARCH_SAMD) || defined(ARDUINO_ARCH_ESP32)
    for (int i = 0; i < WIDTH; i++) {
      byte b = (ptr[i] << 6) | ((ptr[i + WIDTH] << 4) & 0x30) |
               ((ptr[i + WIDTH * 2] << 2) & 0x0C);

      *outclrreg = rgbclkmask; // Clear all data and clock bits together
      *outsetreg = expand[b];  // Set new data bits
      *outsetreg = clkmask;    // Set clock high
    }
    *outclrreg = clkmask; // Set clock low
#elif defined(ARDUINO_ARCH_RENESAS)
    for (int i = 0; i < WIDTH; i++) {
      byte b = (ptr[i] << 6) | ((ptr[i + WIDTH] << 4) & 0x30) |
               ((ptr[i + WIDTH * 2] << 2) & 0x0C);
      for (uint8_t j = 0; j < rgbport_group_count; j++) {
        PortType rgb_value = *rgbport_group[j];
        rgb_value &= ~rgbport_group_mask[j];
        rgb_value |= rgbport_expand[b][j];
        *rgbport_group[j] = rgb_value;
      }
      *clkport |= clkmask;
      *clkport &= ~clkmask;
    }
#endif
  }
#if defined(ARDUINO_ARCH_RENESAS) && RGBMATRIX_RENESAS_ISR_REFRESH
  refresh_busy = false;
#endif
}
